app/Models/ModelLokasi.php

    public function allData()
    {
        return $this->orderBy('id_lokasi', 'DESC')->findAll();
---
SELECT *
FROM `tbl_lokasi`
ORDER BY `id_lokasi` DESC