app/Models/ModelUsulanBarang.php

SELECT *
FROM `tbl_usulan`
ORDER BY `id_` DESC
---
    public function allData()
    {
        return $this->orderBy('id_', 'DESC')->findAll();

DELETE FROM `tbl_usulan`
WHERE `id_` IN ('6')
---
    public function deleteData($data)
    {
        return $this->delete($data['id_']);