app/Models/ModelUsers.php

    public function allData()
    {
        return $this->orderBy('id_user', 'DESC')
            ->findAll();
---
SELECT *
FROM `tbl_user`
ORDER BY `id_user` DESC